{
  "title": "3 Features To Look For In a DNS Provider",
  "published": true,
  "date": "2019-04-16T21:46:03-05:00",
  "description": "There are countless DNS providers out there. Most of them make it easy enough to create and update the various records associated with your domains, but there are a handful of features that can make a DNS provider go from decent to amazing.",
  "body": "\nThere are countless DNS providers out there. Most of them make it easy enough to create and update the various records associated with your domains, but there are a handful of features that can make a DNS provider go from decent to amazing.\n\n#### TTL Limit\n\nMost DNS providers give you the option to adjust the TTL your domains DNS record. This value tells other DNS servers how long to cache the record for. When changing the value of a record it can be handy to set the TTL to be very low sometime before adjusting the record's value so you see the change much faster. There are some DNS providers that won't let you set this value to be very low. For instance, Network Solution's lower limit for TTL values is one hour, which has caused me plenty of issues in the past trying to point records towards new resources. As a rule of thumb, 5 minutes as a lower limit is a good balance between the speed of changes and cacheability.\n\n#### Web forwarding.\n\nThere are plenty of scenarios where you may want to have traffic redirected from one domain or subdomain to another. (e.g [blog.mydomain.com](http://blog.mydomain.com/) to [myotherdomain.com/blog](http://myotherdomain.com/blog)). One way to handle this is to point the domain at a web server or web application and handle the redirect there. However the easiest way, if your DNS provider has the feature, is to use web forwarding. Most DNS providers that support web forwarding make it fairly simple, just choose the domain or subdomain you want to redirect and then choose the URL you want traffic to be directed to. This lets you avoid having to set up any additional redirects to handle simple redirects.\n\n#### ALIAS, ANAME, Virtual CNAME records\n\nA tiny, annoying limitation in the DNS spec is that the [root record for a domain can't be a CNAME](https://medium.freecodecamp.org/why-cant-a-domain-s-root-be-a-cname-8cbab38e5f5c). This can be incredibly frustrating when trying to point a record towards a resource such as an AWS Application Load Balancer. Resources like these don't always provide an actual IP for an A record to use, instead, they usually provide some other DNS name and expect you to create a CNAME record to direct traffic at the resource. Due to this DNS limitation, you would have to have traffic go through a subdomain (such as www.) and have traffic to the root domain be redirected to the subdomain. (using something like web forwarding or a redirect server with a static IP)\n\nHowever, some DNS providers offer workarounds to this DNS limitation through nonstandard record types. The most popular of these are ALIAS, ANAME, or Virtual CNAME records. These records are used exactly like traditional CNAME records. Behind the scenes, the DNS provider will resolve the record's value to the actual IPs and present them to the outside world as A records."
}